backend/src/tests/performance/application.performance.yml
# ══════════════════════════════════════════════════════════════════════════════
# Performance Test — Application API
# Tool: Artillery.io
# Usage: npx artillery run src/tests/performance/application.performance.yml
#
# Prerequisites:
#   • Set ORG_TOKEN to a valid organisation JWT
#   • Set YOUTH_TOKEN to a valid youth JWT
#   • Set a real INTERNSHIP_ID and APPLICATION_ID for read tests
#
# Phases:
#   Phase 1 - Warm-up:  5 users/sec for 30s
#   Phase 2 - Ramp-up: ramps from 5 → 25 users/sec over 60s
#   Phase 3 - Peak Load: 25 users/sec for 60s
# ══════════════════════════════════════════════════════════════════════════════

config:
  target: "http://localhost:5000"
  phases:
    - name: "Warm-up"
      duration: 30
      arrivalRate: 5

    - name: "Ramp-up"
      duration: 60
      arrivalRate: 5
      rampTo: 25

    - name: "Peak Load"
      duration: 60
      arrivalRate: 25

  defaults:
    headers:
      Content-Type: "application/json"

  # Replace these with real tokens and IDs from your running server
  variables:
    youthToken:    "REPLACE_WITH_YOUTH_JWT"
    orgToken:      "REPLACE_WITH_ORG_JWT"
    internshipId:  "REPLACE_WITH_ACTIVE_INTERNSHIP_ID"
    applicationId: "REPLACE_WITH_APPLICATION_ID"

  ensure:
    p99: 2000
    p95: 1000
    maxErrorRate: 5

scenarios:
  # ── Scenario 1: Youth checks own applications ──────────────────────────────
  - name: "Get My Applications"
    weight: 35
    flow:
      - get:
          url: "/api/applications/my-applications"
          headers:
            Authorization: "Bearer {{ youthToken }}"
          expect:
            - statusCode: 200

  # ── Scenario 2: Check application status for an internship ────────────────
  - name: "Check Application Status"
    weight: 25
    flow:
      - get:
          url: "/api/applications/check/{{ internshipId }}"
          headers:
            Authorization: "Bearer {{ youthToken }}"
          expect:
            - statusCode: 200

  # ── Scenario 3: View single application ───────────────────────────────────
  - name: "Get Application By ID"
    weight: 20
    flow:
      - get:
          url: "/api/applications/{{ applicationId }}"
          headers:
            Authorization: "Bearer {{ youthToken }}"
          expect:
            - statusCode:
                - 200
                - 403
                - 404

  # ── Scenario 4: Organisation views applications for an internship ──────────
  - name: "Org Views Applications"
    weight: 20
    flow:
      - get:
          url: "/api/applications/internship/{{ internshipId }}"
          headers:
            Authorization: "Bearer {{ orgToken }}"
          expect:
            - statusCode: 200